perf/bbox2.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 30
      arrivalRate: 5
    - name: RampUp
      duration: 120
      arrivalRate: 50
      rampTo: 100
    - duration: 10
      arrivalRate: 100
      rampTo: 500  
      name: Spike
    - name: load test
      duration: 60 
      arrivalRate: 500
    - name: down
      duration: 10
      arrivalRate: 5



scenarios:
      
  - name: Bbox2 (/)
    flow:
      - get:
          url: '/proxy-9091'