perf/ping.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 50
    - name: Plain
      duration: 30
      arrivalRate: 5
    - duration: 30
      arrivalRate: 20

scenarios:
  - name: Ping
    flow:
      - get:
          url: '/ping'